<script type="text/javascript">
    application.registerPageInitHandler("${navigationItem.contents}", ZoomPicSupport);
</script>
<div class="parag">
	MCS је бесплатан програм за одржавање колекције филмова. Главне карактеристике апликације су:
	<ul>
		<li>
			потпуна контрола над медијумима на којима су филмови,</li>
		<li>
			одржавање база са више хиљада филмова,</li>
		<li>
			TMDB и IMDB интеграције: кеширани постери, "пронађи филм", директни IMDB линкови итд.,</li>
		<li>
			брза претрага за филмом и филтрирање по локацијама/типовима медија/жанровима,</li>
		<li>
			MCS је портабилна апликација (можете је стартовати са УСБ-а или је држати на DropBox-у).</li>
	</ul>
	Једини предуслови за рад програма су Windows и Java Runtime 7.</div>
#zoomPic("Movie Catalog System" "images/projects/mcs2.jpg" "images/projects/mcs2mini.jpg" "pic-left" 255 242)
<div class="parag">
	Идеја иза програма је флексибилност. Можете изабрати сопствене <strong>жанрове</strong>, <strong>типове медија</strong> (који могу бити ДВД-ови, ЦД-ови али такође и екстерни дискови нпр) и <strong>локације</strong> (које се користе да опишу коме сте позајмили неки медијум или да ли је тренутно кући/на послу и слично.</div>
<div class="parag">
	Приликом моделовања домена један аспект је био критичан: веза између филмова и медијума је <em>више на више</em>. Понекад филм или серија може заузимати гомилу ДВД-ова, али такође велики медијум може садржати већи број филмова: замислите екстерни диск са гомилом документарних филмова. Управо је ово разлог зашто ће MCS увек инсистирати да новом филму који управо уносите додате медијуме. Касније тај филм можете, наравно, пребацити на друге медијуме (нпр. када преснимите филм са ДВД-а на екстерни диск). MCS не уноси забрану на дупликате филмова, тако да можете имати колико год желите копија истог филма на различитим медијима у истом тренутку. Као што можете видети велики труд је уложен на пресликавање реалних ситуација у домен MCS апликације.</div>
<div class="parag">
	MCS подржава интернационализацију - подразумеван језик је енглески али можете изабрати српску ћирилицу такође. Ако желите да помогнете у додавању нових језика, слободно ме контактирајте.</div>
#zoomPic("Movie Catalog System (експортовани HTML)" "images/projects/mcs_exported.jpg" "images/projects/mcs_exportedmini.jpg" "pic-right" 187 97)
<div class="parag">
	Још једна битна (и корисна) особина апликације јесте подршка за експортовање <strong>динамичког садржаја</strong>. Када желите да неком једноставно пошаљете Ваш каталог филмова након експортовања добићете у HTML формату листу по којој можете курсором изабрати филмове по жељи. На дну листе ћете након тога видети текст у којем је листа свих медија који садрже филмове које сте изабрали. Тај текст можете послати email-ом на пример.</div>
<div class="parag">
	Преостали детаљи имплементације:
	<ul>
		<li>
			сваки филм може садржати један и само један жанр,</li>
		<li>
			инстанце медија су аутоматски индексиране ради лакшег одржавања (нпр. CD001, DVD123 итд),</li>
		<li>
			сваки пут када изађете из програма направи се SQL dump свих података како бисте (по жељи) увезли податке у неку другу базу података.</li>
	</ul>
</div>
#projectInfo()